[
  {
    "id": "tires_condition_01",
    "text": "Завод производит автомобили данной модели и устанавливает на них колёса с шинами {base_marking}. Допускается применение шин других размеров; все разрешённые варианты приведены в таблице."
  },
  {
    "id": "tires_condition_02",
    "text": "Автомобили этой модели сходят с конвейера с шинами {base_marking}. Завод разрешает использовать иные маркировки шин. Перечень допустимых размеров указан в таблице."
  },
  {
    "id": "tires_condition_03",
    "text": "Базовая комплектация модели включает шины {base_marking}. Вместе с тем завод допускает установку шин других размеров. Соответствующие варианты показаны в таблице."
  },
  {
    "id": "tires_condition_04",
    "text": "На заводе данная модель комплектуется шинами {base_marking}. Также разрешена установка альтернативных размеров шин; все допустимые размеры приведены в таблице."
  },
  {
    "id": "tires_condition_05",
    "text": "При выпуске автомобилей данной модели устанавливаются шины {base_marking}. Возможна замена на шины других маркировок, разрешённые заводом. Полный список доступен в таблице."
  },
  {
    "id": "tires_condition_06",
    "text": "Заводская комплектация колёс — шины {base_marking}. Допускается использование шин иных размеров; разрешённые комбинации указаны в таблице."
  },
  {
    "id": "tires_condition_07",
    "text": "На автомобили этой модели устанавливаются шины {base_marking}. Завод предусматривает возможность применения других размеров шин. Все допустимые варианты даны в таблице."
  },
  {
    "id": "tires_condition_08",
    "text": "Кроссовер этой модели в базовой комплектации оснащается шинами {base_marking}. Завод допускает установку шин других размеров, соответствующих требованиям. Полный перечень допустимых размеров приведён в таблице."
  },
  {
    "id": "tires_condition_09",
    "text": "Внедорожная версия модели сходит с конвейера с шинами {base_marking}. Разрешено применять альтернативные размеры шин. Допустимые варианты указаны в таблице."
  },
  {
    "id": "tires_condition_10",
    "text": "Городской седан этой серии комплектуется шинами {base_marking}. Завод предусматривает возможность использования иных маркировок шин. Перечень разрешённых размеров см. в таблице."
  },
  {
    "id": "tires_condition_11",
    "text": "Электромобиль данной модели поставляется с шинами {base_marking}. Допускается установка шин других размеров при соблюдении требований завода. Все допустимые размеры приведены в таблице."
  },
  {
    "id": "tires_condition_12",
    "text": "Гибридная модификация модели оснащается шинами {base_marking}. Также разрешена установка шин с другими маркировками; допустимые комбинации указаны в таблице."
  },
  {
    "id": "tires_condition_13",
    "text": "Универсал (семейная версия) комплектуется шинами {base_marking}. Завод допускает применение альтернативных размеров шин. Разрешённые варианты показаны в таблице."
  },
  {
    "id": "tires_condition_14",
    "text": "Комплектация «Комфорт» для городской эксплуатации предусматривает шины {base_marking}. Возможна замена на шины других размеров, разрешённых заводом. Полный список доступен в таблице."
  },
  {
    "id": "tires_condition_15",
    "text": "Минивэн этой модели изначально оборудован шинами {base_marking}. Завод разрешает использовать иные размеры шин. Все допустимые размеры даны в таблице."
  }
]