{
  "step_length_distance_find_s_km_by_steps_and_length_cm": [
    "Турист идёт по маршруту в Карелии, зная, что длина его шага составляет {l_cm} см. Пройдя {n} шагов, он хочет узнать пройденное расстояние в километрах.",
    "Спортсмен-ходок тренируется в парке Сокольники. Его шаг равен {l_cm} см. После {n} шагов определите пройденное им расстояние в километрах.",
    "Археолог исследует древнее поселение, измеряя расстояния шагами длиной {l_cm} см. Сделав {n} шагов, какое расстояние он прошёл в километрах?",
    "Геодезист проводит измерения на стройплощадке в Екатеринбурге. Длина его шага {l_cm} см. За {n} шагов какое расстояние он преодолел в километрах?",
    "Почтальон разносит письма по району, его шаг составляет {l_cm} см. Пройдя {n} шагов по маршруту, определите расстояние в километрах."
  ],

  "step_length_distance_find_s_km_by_steps_and_length_m": [
    "Альпинист поднимается к базовому лагерю на Эльбрусе. Его шаг составляет {l_m} м. Пройдя {n} шагов, какое расстояние он преодолел в километрах?",
    "Инспектор обходит территорию завода в Челябинске. Длина его шага {l_m} м. За {n} шагов определите пройденное расстояние в километрах.",
    "Следопыт идёт по тундре на Чукотке, его шаг равен {l_m} м. После {n} шагов вычислите пройденный путь в километрах.",
    "Егерь патрулирует заповедник в Приморье. Его шаг составляет {l_m} м. Сделав {n} шагов, какое расстояние он прошёл в километрах?",
    "Геолог исследует месторождение на Урале. Длина его шага {l_m} м. Пройдя {n} шагов, определите расстояние в километрах."
  ],

  "lightning_distance_find_s_km_by_t_sec_speed_330": [
    "Во время грозы в Подмосковье наблюдатель увидел вспышку молнии, а гром услышал через {t} секунд. На каком расстоянии от него ударила молния?",
    "Метеоролог на станции в Мурманске фиксирует молнию. Звук грома дошёл до него через {t} секунд. Определите расстояние до места удара молнии в километрах.",
    "Турист в палаточном лагере на Байкале наблюдает грозу. Между вспышкой и громом прошло {t} секунд. На каком расстоянии была молния?",
    "Рыбак на озере Селигер увидел молнию, а гром услышал спустя {t} секунд. Вычислите расстояние до места удара молнии в километрах.",
    "Дачник в Тверской области во время грозы засёк время между молнией и громом — {t} секунд. Какое расстояние до молнии?"
  ],

  "taxi_cost_calculate_cost_simple_linear": [
    "В службе такси \"Быстрый старт\" в Воронеже стоимость поездки рассчитывается по тарифу {k} рублей за минуту. Сколько будет стоить поездка продолжительностью {t} минут?",
    "Компания \"Городское такси\" в Саратове берёт {k} рублей за каждую минуту поездки. Определите стоимость {t}-минутной поездки.",
    "Служба \"Комфорт-Авто\" в Тюмени использует тариф {k} рублей в минуту. Вычислите стоимость поездки длительностью {t} минут.",
    "Такси \"Надёжный путь\" в Ярославле оценивает поездки по {k} рублей за минуту. Сколько заплатит пассажир за {t} минут?",
    "Фирма \"Скоростное такси\" в Краснодаре установила тариф {k} рублей за минуту. Найдите стоимость {t}-минутной поездки."
  ],

  "taxi_cost_calculate_cost_with_threshold": [
    "Служба такси \"Премиум\" в Новосибирске берёт {c0} рублей за посадку плюс {c1} рублей за каждую минуту сверх {free_minutes} минут. Рассчитайте стоимость {t}-минутной поездки.",
    "Компания \"Элит-Транс\" в Ростове-на-Дону оценивает поездки: {c0} рублей фиксированно + {c1} рублей за минуту после {free_minutes}-й. Сколько стоит поездка {t} минут?",
    "Такси \"Бизнес-класс\" в Уфе использует тариф: {c0} рублей базовая стоимость + {c1} рублей за каждую минуту свыше {free_minutes}. Определите стоимость {t}-минутной поездки.",
    "Служба \"Комфорт-Плюс\" в Пензе берёт {c0} рублей за первые {free_minutes} минут, затем {c1} рублей за минуту. Вычислите стоимость поездки {t} минут.",
    "Фирма \"Люкс-Авто\" в Архангельске установила тариф: {c0} рублей стартовый взнос + {c1} рублей за минуту после {free_minutes}-й. Найдите стоимость {t}-минутной поездки."
  ],

  "well_cost_calculate_cost_simple_linear": [
    "Фирма \"Простой колодец\" в Курске предлагает услуги по строительству колодцев по тарифу {k} рублей за одно железобетонное кольцо. Определите стоимость колодца глубиной {n} колец.",
    "Компания \"Быстрая скважина\" в Смоленске рассчитывает стоимость работ по {k} рублей за кольцо. Сколько будет стоить колодец из {n} колец?",
    "Служба \"Водоснабжение\" в Брянске берёт {k} рублей за установку каждого кольца. Вычислите общую стоимость колодца глубиной {n} колец.",
    "Фирма \"Чистая вода\" в Калуге оценивает работы по {k} рублей за кольцо без дополнительных платежей. Найдите стоимость колодца из {n} колец.",
    "Компания \"Колодец-Мастер\" в Твери использует простой тариф: {k} рублей за каждое кольцо. Какова стоимость колодца глубиной {n} колец?"
  ],

  "well_cost_calculate_cost_A_plus_Bn": [
    "Компания \"АкваСтрой\" в Белгороде рассчитывает стоимость колодца по формуле: {A} рублей базовая цена + {B} рублей за каждое кольцо. Определите стоимость колодца из {n} колец.",
    "Фирма \"Чистый источник\" в Рязани оценивает колодцы: {A} рублей работа + {B} рублей за кольцо. Сколько будет стоить колодец глубиной {n} колец?",
    "Служба \"Водные ресурсы\" в Липецке берёт {A} рублей за обустройство плюс {B} рублей за установку каждого кольца. Вычислите стоимость колодца из {n} колец.",
    "Компания \"Гидромонтаж\" в Орле использует тариф: {A} рублей фиксированная стоимость + {B} рублей за кольцо. Найдите цену колодца глубиной {n} колец.",
    "Фирма \"Родниковая вода\" в Тамбове оценивает работы по {A} рублей за выезд плюс {B} рублей за каждое железобетонное кольцо. Какова стоимость колодца из {n} колец?"
  ],

  "well_cost_calculate_cost_company_A": [
    "Фирма \"АкваПлюс\" (компания А) в Иванове предлагает услуги по строительству колодцев: {A} рублей стартовая стоимость + {B} рублей за каждое кольцо. Определите общую стоимость колодца из {n} колец.",
    "Компания \"Водоснабжение А\" в Костроме рассчитывает цену колодца: {A} рублей базовый тариф + {B} рублей за кольцо. Сколько будет стоить колодец глубиной {n} колец?",
    "Служба \"Гидро-А\" в Владимире берёт {A} рублей за подготовительные работы плюс {B} рублей за установку каждого кольца. Вычислите стоимость колодца из {n} колец.",
    "Фирма \"Источник-А\" в Ярославле использует тариф: {A} рублей фиксированная плата + {B} рублей за кольцо. Найдите цену колодца глубиной {n} колец.",
    "Компания \"Колодец-Альфа\" в Суздале оценивает работы по {A} рублей за организационные расходы + {B} рублей за каждое железобетонное кольцо. Какова стоимость колодца из {n} колец?"
  ],

  "well_cost_calculate_cost_company_B": [
    "Фирма \"АкваБета\" (компания Б) в Муроме предлагает услуги: {A} рублей первоначальный взнос + {B} рублей за каждое кольцо. Определите общую стоимость колодца из {n} колец.",
    "Компания \"Водоснабжение Б\" в Коврове рассчитывает цену: {A} рублей стартовый платёж + {B} рублей за кольцо. Сколько будет стоить колодец глубиной {n} колец?",
    "Служба \"Гидро-Б\" в Александрове берёт {A} рублей за мобилизацию техники плюс {B} рублей за установку каждого кольца. Вычислите стоимость колодца из {n} колец.",
    "Фирма \"Источник-Б\" в Переславле-Залесском использует тариф: {A} рублей базовые расходы + {B} рублей за кольцо. Найдите цену колодца глубиной {n} колец.",
    "Компания \"Колодец-Бета\" в Ростове Великом оценивает работы по {A} рублей за подготовку участка + {B} рублей за каждое железобетонное кольцо. Какова стоимость колодца из {n} колец?"
  ],

  "temperature_conversion_find_C_from_F": [
    "Метеостанция в Магадане получила данные о температуре {F}°F от американских коллег. Переведите эту температуру в градусы Цельсия.",
    "Турист из России в Майами видит на термометре {F}°F. Какая это температура по шкале Цельсия?",
    "Инженер на заводе в Набережных Челнах работает с американским оборудованием, показывающим {F}°F. Определите температуру в градусах Цельсия.",
    "Повар в ресторане Нижнего Новгорода использует американскую духовку с температурой {F}°F. Переведите в градусы Цельсия.",
    "Учёный в лаборатории Томска получил данные эксперимента при {F}°F. Вычислите температуру по шкале Цельсия."
  ],

  "temperature_conversion_find_F_from_C": [
    "Российский метеоролог из Мурманска передаёт коллегам в США данные о температуре {C}°C. Переведите в градусы Фаренгейта.",
    "Турист из Казани планирует поездку в Америку и хочет понять, как {C}°C переводится в градусы Фаренгейта.",
    "Инженер завода в Челябинске отправляет техническую документацию в США с температурой {C}°C. Определите значение по Фаренгейту.",
    "Научный сотрудник из Новосибирска публикует результаты эксперимента при {C}°C для международного журнала. Вычислите температуру в градусах Фаренгейта.",
    "Спортсмен из Сочи готовится к соревнованиям в Канаде, где прогнозируется {C}°C. Найдите эту температуру по шкале Фаренгейта."
  ]
}